
class TileType :
    # 牌番号
    REDS      = {0, 10, 20}                   # 赤の牌番号（0:赤5萬, 10, 赤5筒, 20:赤5索）
    BLANKS    = {0, 10, 20, 30}               # handで使わない番号
    FIVES     = {5, 15, 25}                   # 各種5の牌の牌番号
    NINES     = {9, 19, 29}                   # 各種9の牌の牌番号
    GREENS    = {22, 23, 24, 26, 28, 36}      # 索子の緑 緑一色用
    TERMINALS = {1, 11, 21, 9, 19, 29}        # 端牌
    WINDS     = {31, 32, 33, 34}              # 風牌
    DRAGONS   = {35, 36, 37}                  # 白, 發, 中
    HONORS    = {31, 32, 33, 34, 35, 36, 37}  # 字牌


